test/perf/results/round3-ultra9-185h/detect_rtt20_c200.txt
==============================================================
Endpoint : http://127.0.0.1:20080/api/v1/filter/detect
RTT      : 20ms    Conns: 200   Threads: 16   Duration: 30s
Time     : 2026-05-18T20:57:18+08:00
==============================================================
Running 30s test @ http://127.0.0.1:20080/api/v1/filter/detect
  16 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.74ms    2.79ms  84.30ms   76.72%
    Req/Sec   449.25     27.21   606.00     79.04%
  Latency Distribution
     50%   26.29ms
     75%   28.03ms
     90%   30.01ms
     99%   35.55ms
  215018 requests in 30.05s, 235.37MB read
Requests/sec:   7155.45
Transfer/sec:      7.83MB